Repository: 15blex/15blex.github.io
Catalog: src/locales/*.po
Languages: fr

source: High School, Information Technology
fr: Lycée, Informatique

source: Comprehensive study of computer science fundamentals, programming, and electronics.
fr: Étude complète des fondamentaux de l'informatique, de la programmation et de l'électronique.

source: Education
fr: Éducation

source: Grade:
fr: Note :

source: Hi! I'm a developer who loves digging into how things work.
fr: Salut ! Je suis un développeur qui adore comprendre comment fonctionnent les choses.

source: My comfort zone is in the <0>JavaScript</0> and <1>TypeScript</1> ecosystem (both frontend and backend), but I'm currently diving deep into systems programming with <2>Go</2> and <3>Rust</3>.
fr: Ma zone de confort est l'écosystème <0>JavaScript</0> et <1>TypeScript</1> (frontend et backend), mais je me plonge actuellement dans la programmation système avec <2>Go</2> et <3>Rust</3>.

source: I'm also fascinated by the intersection of the digital and physical worlds through <0>AR/VR</0>, <1>IoT</1>, and <2>Robotics</2>. I love meeting new people and swapping ideas, so don't hesitate to reach out!
fr: Je suis également fasciné par l'intersection des mondes numérique et physique à travers la <0>RA/RV</0>, l'<1>IoT</1> et la <2>Robotique</2>. J'adore rencontrer de nouvelles personnes et échanger des idées, alors n'hésitez pas à me contacter !

source: Building scalable web applications with modern JS/TS stacks.
fr: Création d'applications web évolutives avec des stacks JS/TS modernes.

source: Systems
fr: Systèmes

source: Exploring high-performance computing with Go and Rust.
fr: Exploration du calcul haute performance avec Go et Rust.

source: Future Tech
fr: Technologies Futures

source: Bridging digital and physical realms via IoT and Robotics.
fr: Relier les domaines numérique et physique via l'IoT et la Robotique.

source: About
fr: À propos

source: Experience
fr: Expérience

source: Skills
fr: Compétences

source: Languages
fr: Langues

source: Projects
fr: Projets

source: Toggle theme
fr: Changer de thème

source: Select language
fr: Choisir la langue

source: Select Language
fr: Choisir la Langue

source: Frontend Engineer
fr: Ingénieur Frontend

source: Crafting pixel-perfect, performant, and accessible web experiences.
fr: Création d'expériences web pixel-perfect, performantes et accessibles.

source: Barcelona, ES
fr: Barcelone, ES

source: Full-time
fr: Temps plein

source: Aug 2019 - Present
fr: Août 2019 - Présent

source: Barcelona Area, Spain
fr: Région de Barcelone, Espagne

source: Full Stack Developer
fr: Développeur Full Stack

source: Oct 2018 - Jul 2019
fr: Oct 2018 - Juil 2019

source: Bologna Area, Italy
fr: Région de Bologne, Italie

source: Analyst Developer
fr: Analyste Développeur

source: Jul 2018 - Sep 2018
fr: Juil 2018 - Sep 2018

source: Nov 2017 - Jul 2018
fr: Nov 2017 - Juil 2018

source: Interface Developer for SCAI Consulting
fr: Développeur d'Interface pour SCAI Consulting

source: Jul 2016 - Sep 2017
fr: Juil 2016 - Sep 2017

source: Web Developer
fr: Développeur Web

source: Jun 2015 - Jul 2016
fr: Juin 2015 - Juil 2016

source: Dynamic and static website development, SEO
fr: Développement de sites web dynamiques et statiques, SEO

source: Substitute Teacher
fr: Professeur Remplaçant

source: Dec 2015 - Jun 2016
fr: Déc 2015 - Juin 2016

source: Teaching in Electronic Laboratory
fr: Enseignement en Laboratoire d'Électronique

source: Oct 2015 - Dec 2015
fr: Oct 2015 - Déc 2015

source: Feb 2015 - Jun 2015
fr: Fév 2015 - Juin 2015

source: Electronics laboratory teacher
fr: Professeur de laboratoire d'électronique

source: Jan 2014 - Apr 2015
fr: Jan 2014 - Avr 2015

source: Static website development and basic SEO
fr: Développement de sites web statiques et SEO de base

source: Freelancer
fr: Freelance

source: Web design and static website development
fr: Web design et développement de sites web statiques

source: Frontend Engineer focused on building accessible, pixel-perfect web experiences.
fr: Ingénieur Frontend concentré sur la création d'expériences web accessibles et pixel-perfect.

source: Connect
fr: Connexion

source: © {0} Alessandro Bonanno. Built with SvelteKit.
fr: © {0} Alessandro Bonanno. Construit avec SvelteKit.

source: Back to top
fr: Haut de page

source: Italian
fr: Italien

source: Native
fr: Natif

source: English
fr: Anglais

source: Fluent
fr: Courant

source: Spanish
fr: Espagnol

source: Basic
fr: Basique

source: French
fr: Français

source: Learning
fr: Apprentissage

source: Portuguese
fr: Portugais

source: Frameworks & Libraries
fr: Frameworks & Bibliothèques

source: Tools & Platforms
fr: Outils & Plateformes

source: Interests & Focus
fr: Intérêts & Focus

source: UI/UX Design
fr: Design UI/UX

source: Robotics
fr: Robotique

source: Performance Optimization
fr: Optimisation des Performances

source: Accessibility
fr: Accessibilité

source: Technical Skills
fr: Compétences Techniques

source: E-commerce Platform
fr: Plateforme E-commerce

source: A full-featured online store built with SvelteKit and Stripe integration. Features include a custom cart implementation, user authentication, and a responsive checkout flow.
fr: Une boutique en ligne complète construite avec SvelteKit et l'intégration Stripe. Les fonctionnalités incluent une implémentation de panier personnalisée, l'authentification des utilisateurs et un flux de paiement réactif.

source: Task Management App
fr: App de Gestion de Tâches

source: A productivity tool for teams with real-time updates using WebSockets. Supports drag-and-drop task organization, team collaboration features, and dark mode.
fr: Un outil de productivité pour les équipes avec des mises à jour en temps réel utilisant WebSockets. Prend en charge l'organisation des tâches par glisser-déposer, les fonctionnalités de collaboration d'équipe et le mode sombre.

source: Portfolio Website
fr: Site Web Portfolio

source: A modern, high-performance personal portfolio website built with SvelteKit. Features a premium design system, dark mode support, and perfect Lighthouse scores.
fr: Un site web de portfolio personnel moderne et performant construit avec SvelteKit. Dispose d'un système de design premium, d'un support du mode sombre et de scores Lighthouse parfaits.

source: CSS Variables
fr: Variables CSS

source: Featured Projects
fr: Projets en Vedette

source: View Project
fr: Voir le Projet

source: GitHub Repo
fr: Dépôt GitHub
